app/controllers/movies_controller.rb

  def index
    @sort_column = Movie.column_names.include?(cache.load(:sort)) ? cache.load(:sort) : "id"
    @filter = FilterBy.new(Movie)
    @movies = @filter.rating(cache.load(:ratings)).order(@sort_column)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'NC-17', 'R')

  def same_director
    @movie = Movie.find(params[:id])
    @movies = @movie.find_by_director
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'George Lucas'